Auto_CNN G10:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 112, 112, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 112, 112, 64) 1792        average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 112, 112, 64) 256         SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 112, 112, 64) 0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 112, 112, 256 147712      SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 112, 112, 256 1024        average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 112, 112, 256 1024        SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 112, 112, 256 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 112, 112, 256 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 56, 56, 256)  0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 28, 28, 256)  0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
SkipLayer_2/Conv1 (Conv2D)      (None, 28, 28, 512)  1180160     max_pooling2d[0][0]              
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm1 (BatchNo (None, 28, 28, 512)  2048        SkipLayer_2/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/ReLU1 (Activation)  (None, 28, 28, 512)  0           SkipLayer_2/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/Conv2 (Conv2D)      (None, 28, 28, 64)   294976      SkipLayer_2/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Reshape (Conv2D)    (None, 28, 28, 64)   16448       max_pooling2d[0][0]              
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm2 (BatchNo (None, 28, 28, 64)   256         SkipLayer_2/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Add (Add)           (None, 28, 28, 64)   0           SkipLayer_2/Reshape[0][0]        
                                                                 SkipLayer_2/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/ReLU2 (Activation)  (None, 28, 28, 64)   0           SkipLayer_2/Add[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 50176)        0           SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            50177       flatten[0][0]                    
==================================================================================================
Total params: 1,695,873
Trainable params: 1,694,081
Non-trainable params: 1,792
__________________________________________________________________________________________________
RESULTS: 
ACC:0.609 
SS:0.722 
SP:0.200 
Pr:0.765 
Score:0.598 
Searching time:734.787 
Fitting time:0.000