Auto_CNN:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 112, 112, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 112, 112, 64) 1792        average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 112, 112, 64) 256         SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 112, 112, 64) 0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 112, 112, 64) 36928       SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 112, 112, 64) 256         average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 112, 112, 64) 256         SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 112, 112, 64) 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 112, 112, 64) 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
SkipLayer_2/Conv1 (Conv2D)      (None, 112, 112, 32) 18464       SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm1 (BatchNo (None, 112, 112, 32) 128         SkipLayer_2/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/ReLU1 (Activation)  (None, 112, 112, 32) 0           SkipLayer_2/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/Conv2 (Conv2D)      (None, 112, 112, 64) 18496       SkipLayer_2/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Reshape (Conv2D)    (None, 112, 112, 64) 4160        SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm2 (BatchNo (None, 112, 112, 64) 256         SkipLayer_2/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Add (Add)           (None, 112, 112, 64) 0           SkipLayer_2/Reshape[0][0]        
                                                                 SkipLayer_2/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/ReLU2 (Activation)  (None, 112, 112, 64) 0           SkipLayer_2/Add[0][0]            
__________________________________________________________________________________________________
SkipLayer_3/Conv1 (Conv2D)      (None, 112, 112, 64) 36928       SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/BatchNorm1 (BatchNo (None, 112, 112, 64) 256         SkipLayer_3/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/ReLU1 (Activation)  (None, 112, 112, 64) 0           SkipLayer_3/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_3/Conv2 (Conv2D)      (None, 112, 112, 64) 36928       SkipLayer_3/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/Reshape (Conv2D)    (None, 112, 112, 64) 4160        SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/BatchNorm2 (BatchNo (None, 112, 112, 64) 256         SkipLayer_3/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/Add (Add)           (None, 112, 112, 64) 0           SkipLayer_3/Reshape[0][0]        
                                                                 SkipLayer_3/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_3/ReLU2 (Activation)  (None, 112, 112, 64) 0           SkipLayer_3/Add[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 802816)       0           SkipLayer_3/ReLU2[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            802817      flatten[0][0]                    
==================================================================================================
Total params: 962,337
Trainable params: 961,633
Non-trainable params: 704
__________________________________________________________________________________________________
RESULTS: 
ACC:0.826 
SS:0.882 
SP:0.667 
Pr:0.882 
Score:0.825 
Searching time:336.753 
Fitting time:0.000