Auto_CNN G4:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 224, 224, 32) 896         input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 224, 224, 32) 128         SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 224, 224, 32) 0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 224, 224, 64) 18496       SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 224, 224, 64) 256         input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 224, 224, 64) 256         SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 224, 224, 64) 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 224, 224, 64) 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 112, 112, 64) 0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Conv1 (Conv2D)      (None, 112, 112, 32) 18464       average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm1 (BatchNo (None, 112, 112, 32) 128         SkipLayer_2/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/ReLU1 (Activation)  (None, 112, 112, 32) 0           SkipLayer_2/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/Conv2 (Conv2D)      (None, 112, 112, 64) 18496       SkipLayer_2/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Reshape (Conv2D)    (None, 112, 112, 64) 4160        average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm2 (BatchNo (None, 112, 112, 64) 256         SkipLayer_2/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Add (Add)           (None, 112, 112, 64) 0           SkipLayer_2/Reshape[0][0]        
                                                                 SkipLayer_2/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/ReLU2 (Activation)  (None, 112, 112, 64) 0           SkipLayer_2/Add[0][0]            
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 56, 56, 64)   0           SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 28, 28, 64)   0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
flatten (Flatten)               (None, 50176)        0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            50177       flatten[0][0]                    
==================================================================================================
Total params: 111,713
Trainable params: 111,329
Non-trainable params: 384
__________________________________________________________________________________________________
RESULTS: 
ACC:0.696 
SS:0.750 
SP:0.333 
Pr:0.882 
Score:0.680 
Searching time:473.296 
Fitting time:0.000