Auto_CNN G1:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 112, 112, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 112, 112, 32) 896         average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 112, 112, 32) 128         SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 112, 112, 32) 0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 112, 112, 32) 9248        SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 112, 112, 32) 128         average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 112, 112, 32) 128         SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 112, 112, 32) 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 112, 112, 32) 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 56, 56, 32)   0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Conv1 (Conv2D)      (None, 56, 56, 256)  73984       max_pooling2d[0][0]              
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm1 (BatchNo (None, 56, 56, 256)  1024        SkipLayer_2/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/ReLU1 (Activation)  (None, 56, 56, 256)  0           SkipLayer_2/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/Conv2 (Conv2D)      (None, 56, 56, 128)  295040      SkipLayer_2/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Reshape (Conv2D)    (None, 56, 56, 128)  4224        max_pooling2d[0][0]              
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm2 (BatchNo (None, 56, 56, 128)  512         SkipLayer_2/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Add (Add)           (None, 56, 56, 128)  0           SkipLayer_2/Reshape[0][0]        
                                                                 SkipLayer_2/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/ReLU2 (Activation)  (None, 56, 56, 128)  0           SkipLayer_2/Add[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 401408)       0           SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            401409      flatten[0][0]                    
==================================================================================================
Total params: 786,721
Trainable params: 785,825
Non-trainable params: 896
__________________________________________________________________________________________________
RESULTS: 
ACC:0.739 
SS:0.824 
SP:0.500 
Pr:0.824 
Score:0.738 
Searching time:23.360 
Fitting time:0.000