FPNAS-B2 BS16:Model: "functional_731"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_19 (InputLayer)           [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
split_431 (Split)               [(None, 112, 224, 3) 0           input_19[0][0]                   
__________________________________________________________________________________________________
conv2d_746 (Conv2D)             (None, 56, 112, 32)  864         split_431[0][1]                  
__________________________________________________________________________________________________
inverted_residual_534 (Inverted (None, 56, 112, 32)  1064        split_431[0][0]                  
__________________________________________________________________________________________________
batch_normalization_659 (BatchN (None, 56, 112, 32)  128         conv2d_746[0][0]                 
__________________________________________________________________________________________________
concatenate_431 (Concatenate)   (None, 112, 112, 32) 0           inverted_residual_534[0][0]      
                                                                 batch_normalization_659[0][0]    
__________________________________________________________________________________________________
add_462 (Add)                   (None, 112, 112, 32) 0           concatenate_431[0][0]            
                                                                 concatenate_431[0][0]            
__________________________________________________________________________________________________
conv2d_747 (Conv2D)             (None, 56, 56, 64)   18432       concatenate_431[0][0]            
__________________________________________________________________________________________________
inverted_residual_535 (Inverted (None, 56, 56, 64)   29184       add_462[0][0]                    
__________________________________________________________________________________________________
batch_normalization_660 (BatchN (None, 56, 56, 64)   256         conv2d_747[0][0]                 
__________________________________________________________________________________________________
add_463 (Add)                   (None, 56, 56, 64)   0           inverted_residual_535[0][0]      
                                                                 batch_normalization_660[0][0]    
__________________________________________________________________________________________________
flatten_365 (Flatten)           (None, 200704)       0           add_463[0][0]                    
__________________________________________________________________________________________________
dropout_365 (Dropout)           (None, 200704)       0           flatten_365[0][0]                
__________________________________________________________________________________________________
dense_383 (Dense)               (None, 1)            200705      dropout_365[0][0]                
==================================================================================================
Total params: 250,633
Trainable params: 249,153
Non-trainable params: 1,480
__________________________________________________________________________________________________
RESULTS: 
ACC:0.783 
SP:0.600 
SS:0.833 
Pr:0.882 
Score:0.857 
Searching time:648.408 
Fitting time:15.079