FPNAS:Model: "functional_1733"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_11 (InputLayer)           [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
split_2688 (Split)              [(None, 112, 224, 3) 0           input_11[0][0]                   
__________________________________________________________________________________________________
conv2d_3689 (Conv2D)            (None, 56, 112, 32)  864         split_2688[0][1]                 
__________________________________________________________________________________________________
inverted_residual_4081 (Inverte (None, 56, 112, 32)  1064        split_2688[0][0]                 
__________________________________________________________________________________________________
batch_normalization_3689 (Batch (None, 56, 112, 32)  128         conv2d_3689[0][0]                
__________________________________________________________________________________________________
conv2d_3690 (Conv2D)            (None, 56, 112, 32)  864         split_2688[0][1]                 
__________________________________________________________________________________________________
add_4406 (Add)                  (None, 56, 112, 32)  0           inverted_residual_4081[0][0]     
                                                                 batch_normalization_3689[0][0]   
__________________________________________________________________________________________________
batch_normalization_3690 (Batch (None, 56, 112, 32)  128         conv2d_3690[0][0]                
__________________________________________________________________________________________________
concatenate_2688 (Concatenate)  (None, 112, 112, 32) 0           add_4406[0][0]                   
                                                                 batch_normalization_3690[0][0]   
__________________________________________________________________________________________________
split_2689 (Split)              [(None, 56, 112, 32) 0           concatenate_2688[0][0]           
__________________________________________________________________________________________________
add_4407 (Add)                  (None, 56, 112, 32)  0           split_2689[0][0]                 
                                                                 split_2689[0][1]                 
__________________________________________________________________________________________________
concatenate_2689 (Concatenate)  (None, 112, 112, 32) 0           add_4407[0][0]                   
                                                                 split_2689[0][1]                 
__________________________________________________________________________________________________
inverted_residual_4082 (Inverte (None, 56, 56, 32)   15680       concatenate_2689[0][0]           
__________________________________________________________________________________________________
inverted_residual_4083 (Inverte (None, 28, 28, 64)   21952       inverted_residual_4082[0][0]     
__________________________________________________________________________________________________
split_2690 (Split)              [(None, 14, 28, 64), 0           inverted_residual_4083[0][0]     
__________________________________________________________________________________________________
conv2d_3691 (Conv2D)            (None, 28, 28, 64)   18432       inverted_residual_4082[0][0]     
__________________________________________________________________________________________________
concatenate_2690 (Concatenate)  (None, 28, 28, 64)   0           split_2690[0][0]                 
                                                                 split_2690[0][1]                 
__________________________________________________________________________________________________
batch_normalization_3691 (Batch (None, 28, 28, 64)   256         conv2d_3691[0][0]                
__________________________________________________________________________________________________
add_4408 (Add)                  (None, 28, 28, 64)   0           concatenate_2690[0][0]           
                                                                 batch_normalization_3691[0][0]   
__________________________________________________________________________________________________
add_4409 (Add)                  (None, 28, 28, 64)   0           add_4408[0][0]                   
                                                                 add_4408[0][0]                   
__________________________________________________________________________________________________
add_4410 (Add)                  (None, 28, 28, 64)   0           add_4409[0][0]                   
                                                                 add_4408[0][0]                   
__________________________________________________________________________________________________
inverted_residual_4084 (Inverte (None, 28, 28, 64)   55936       add_4410[0][0]                   
__________________________________________________________________________________________________
split_2691 (Split)              [(None, 14, 28, 64), 0           inverted_residual_4084[0][0]     
__________________________________________________________________________________________________
conv2d_3692 (Conv2D)            (None, 14, 28, 128)  73728       split_2691[0][1]                 
__________________________________________________________________________________________________
inverted_residual_4085 (Inverte (None, 14, 28, 128)  107520      split_2691[0][0]                 
__________________________________________________________________________________________________
batch_normalization_3692 (Batch (None, 14, 28, 128)  512         conv2d_3692[0][0]                
__________________________________________________________________________________________________
conv2d_3693 (Conv2D)            (None, 28, 28, 128)  73728       inverted_residual_4084[0][0]     
__________________________________________________________________________________________________
concatenate_2691 (Concatenate)  (None, 28, 28, 128)  0           inverted_residual_4085[0][0]     
                                                                 batch_normalization_3692[0][0]   
__________________________________________________________________________________________________
batch_normalization_3693 (Batch (None, 28, 28, 128)  512         conv2d_3693[0][0]                
__________________________________________________________________________________________________
add_4411 (Add)                  (None, 28, 28, 128)  0           concatenate_2691[0][0]           
                                                                 batch_normalization_3693[0][0]   
__________________________________________________________________________________________________
split_2692 (Split)              [(None, 14, 28, 128) 0           add_4411[0][0]                   
__________________________________________________________________________________________________
conv2d_3694 (Conv2D)            (None, 7, 14, 128)   147456      split_2692[0][1]                 
__________________________________________________________________________________________________
inverted_residual_4086 (Inverte (None, 7, 14, 128)   140288      split_2692[0][0]                 
__________________________________________________________________________________________________
batch_normalization_3694 (Batch (None, 7, 14, 128)   512         conv2d_3694[0][0]                
__________________________________________________________________________________________________
conv2d_3695 (Conv2D)            (None, 7, 14, 128)   147456      split_2692[0][1]                 
__________________________________________________________________________________________________
add_4412 (Add)                  (None, 7, 14, 128)   0           inverted_residual_4086[0][0]     
                                                                 batch_normalization_3694[0][0]   
__________________________________________________________________________________________________
batch_normalization_3695 (Batch (None, 7, 14, 128)   512         conv2d_3695[0][0]                
__________________________________________________________________________________________________
concatenate_2692 (Concatenate)  (None, 14, 14, 128)  0           add_4412[0][0]                   
                                                                 batch_normalization_3695[0][0]   
__________________________________________________________________________________________________
flatten_866 (Flatten)           (None, 25088)        0           concatenate_2692[0][0]           
__________________________________________________________________________________________________
dense_877 (Dense)               (None, 1)            25089       flatten_866[0][0]                
==================================================================================================
Total params: 832,617
Trainable params: 823,201
Non-trainable params: 9,416
__________________________________________________________________________________________________
RESULTS: 
ACC:0.609 
SP:0.400 
SS:1.000 
Pr:0.471 
Score:0.640 
Searching time:4092.331 
Fitting time:25.031