FPNAS2-B2 T1 Exp:Model: "functional_3375"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_10 (InputLayer)           [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d_7618 (Conv2D)            (None, 224, 224, 32) 2432        input_10[0][0]                   
__________________________________________________________________________________________________
conv2d_7619 (Conv2D)            (None, 224, 224, 32) 2432        input_10[0][0]                   
__________________________________________________________________________________________________
conv2d_7620 (Conv2D)            (None, 224, 224, 32) 1024        conv2d_7618[0][0]                
__________________________________________________________________________________________________
conv2d_7621 (Conv2D)            (None, 224, 224, 32) 1024        conv2d_7619[0][0]                
__________________________________________________________________________________________________
batch_normalization_6491 (Batch (None, 224, 224, 32) 128         conv2d_7620[0][0]                
__________________________________________________________________________________________________
batch_normalization_6492 (Batch (None, 224, 224, 32) 128         conv2d_7621[0][0]                
__________________________________________________________________________________________________
add_2584 (Add)                  (None, 224, 224, 32) 0           batch_normalization_6491[0][0]   
                                                                 batch_normalization_6492[0][0]   
__________________________________________________________________________________________________
batch_normalization_6493 (Batch (None, 224, 224, 32) 128         add_2584[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2510 (MaxPooling2 (None, 112, 112, 32) 0           batch_normalization_6493[0][0]   
__________________________________________________________________________________________________
conv2d_7622 (Conv2D)            (None, 112, 112, 64) 18496       max_pooling2d_2510[0][0]         
__________________________________________________________________________________________________
conv2d_7623 (Conv2D)            (None, 112, 112, 64) 2048        max_pooling2d_2510[0][0]         
__________________________________________________________________________________________________
conv2d_7624 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_7622[0][0]                
__________________________________________________________________________________________________
batch_normalization_6494 (Batch (None, 112, 112, 64) 256         conv2d_7623[0][0]                
__________________________________________________________________________________________________
batch_normalization_6495 (Batch (None, 112, 112, 64) 256         conv2d_7624[0][0]                
__________________________________________________________________________________________________
add_2585 (Add)                  (None, 112, 112, 64) 0           batch_normalization_6494[0][0]   
                                                                 batch_normalization_6495[0][0]   
__________________________________________________________________________________________________
batch_normalization_6496 (Batch (None, 112, 112, 32) 128         max_pooling2d_2510[0][0]         
__________________________________________________________________________________________________
conv2d_7625 (Conv2D)            (None, 112, 112, 64) 4096        add_2585[0][0]                   
__________________________________________________________________________________________________
conv2d_7626 (Conv2D)            (None, 112, 112, 64) 2048        batch_normalization_6496[0][0]   
__________________________________________________________________________________________________
batch_normalization_6497 (Batch (None, 112, 112, 64) 256         conv2d_7625[0][0]                
__________________________________________________________________________________________________
batch_normalization_6498 (Batch (None, 112, 112, 64) 256         conv2d_7626[0][0]                
__________________________________________________________________________________________________
add_2586 (Add)                  (None, 112, 112, 64) 0           batch_normalization_6497[0][0]   
                                                                 batch_normalization_6498[0][0]   
__________________________________________________________________________________________________
max_pooling2d_2511 (MaxPooling2 (None, 56, 56, 64)   0           add_2586[0][0]                   
__________________________________________________________________________________________________
flatten_1687 (Flatten)          (None, 200704)       0           max_pooling2d_2511[0][0]         
__________________________________________________________________________________________________
dropout_1687 (Dropout)          (None, 200704)       0           flatten_1687[0][0]               
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1)            200705      dropout_1687[0][0]               
==================================================================================================
Total params: 239,937
Trainable params: 239,169
Non-trainable params: 768
__________________________________________________________________________________________________
RESULTS: 
ACC:0.522 
SP:0.353 
SS:1.000 
Pr:0.353 
Score:0.522 
Searching time:0.890 
Fitting time:17.788