FPNAS2-B2 T1:Model: "functional_955"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
batch_normalization_1007 (Batch (None, 224, 224, 3)  12          input_4[0][0]                    
__________________________________________________________________________________________________
conv2d_1170 (Conv2D)            (None, 224, 224, 32) 2432        input_4[0][0]                    
__________________________________________________________________________________________________
conv2d_1171 (Conv2D)            (None, 224, 224, 32) 96          batch_normalization_1007[205][0] 
__________________________________________________________________________________________________
conv2d_1172 (Conv2D)            (None, 224, 224, 32) 1024        conv2d_1170[205][0]              
__________________________________________________________________________________________________
batch_normalization_1008 (Batch (None, 224, 224, 32) 128         conv2d_1171[205][0]              
__________________________________________________________________________________________________
batch_normalization_1009 (Batch (None, 224, 224, 32) 128         conv2d_1172[205][0]              
__________________________________________________________________________________________________
add_390 (Add)                   (None, 224, 224, 32) 0           batch_normalization_1008[205][0] 
                                                                 batch_normalization_1009[205][0] 
__________________________________________________________________________________________________
batch_normalization_1010 (Batch (None, 224, 224, 32) 128         add_390[205][0]                  
__________________________________________________________________________________________________
conv2d_1173 (Conv2D)            (None, 224, 224, 32) 2432        input_4[0][0]                    
__________________________________________________________________________________________________
conv2d_1174 (Conv2D)            (None, 224, 224, 32) 1024        batch_normalization_1010[205][0] 
__________________________________________________________________________________________________
conv2d_1175 (Conv2D)            (None, 224, 224, 32) 1024        conv2d_1173[205][0]              
__________________________________________________________________________________________________
batch_normalization_1011 (Batch (None, 224, 224, 32) 128         conv2d_1174[205][0]              
__________________________________________________________________________________________________
batch_normalization_1012 (Batch (None, 224, 224, 32) 128         conv2d_1175[205][0]              
__________________________________________________________________________________________________
add_391 (Add)                   (None, 224, 224, 32) 0           batch_normalization_1011[205][0] 
                                                                 batch_normalization_1012[205][0] 
__________________________________________________________________________________________________
max_pooling2d_232 (MaxPooling2D (None, 112, 112, 32) 0           add_391[205][0]                  
__________________________________________________________________________________________________
batch_normalization_1367 (Batch (None, 112, 112, 32) 128         max_pooling2d_232[205][0]        
__________________________________________________________________________________________________
conv2d_1578 (Conv2D)            (None, 112, 112, 64) 2048        batch_normalization_1367[2][0]   
__________________________________________________________________________________________________
conv2d_1579 (Conv2D)            (None, 112, 112, 64) 2048        max_pooling2d_232[205][0]        
__________________________________________________________________________________________________
batch_normalization_1368 (Batch (None, 112, 112, 64) 256         conv2d_1578[2][0]                
__________________________________________________________________________________________________
batch_normalization_1369 (Batch (None, 112, 112, 64) 256         conv2d_1579[2][0]                
__________________________________________________________________________________________________
add_523 (Add)                   (None, 112, 112, 64) 0           batch_normalization_1368[2][0]   
                                                                 batch_normalization_1369[2][0]   
__________________________________________________________________________________________________
conv2d_1580 (Conv2D)            (None, 112, 112, 64) 36928       add_523[2][0]                    
__________________________________________________________________________________________________
max_pooling2d_321 (MaxPooling2D (None, 56, 56, 64)   0           conv2d_1580[2][0]                
__________________________________________________________________________________________________
flatten_477 (Flatten)           (None, 200704)       0           max_pooling2d_321[2][0]          
__________________________________________________________________________________________________
dropout_477 (Dropout)           (None, 200704)       0           flatten_477[0][0]                
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            200705      dropout_477[0][0]                
==================================================================================================
Total params: 251,053
Trainable params: 250,407
Non-trainable params: 646
__________________________________________________________________________________________________
RESULTS: 
ACC:0.261 
SP:0.261 
SS:0.000 
Pr:0.000 
Score:0.000 
Searching time:1126.469 
Fitting time:14.740