Auto_CNN 10P-10E G100:

Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 224, 224, 32) 896         input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 224, 224, 32) 0           SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 224, 224, 128 512         input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 224, 224, 128 36992       SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 224, 224, 128 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 224, 224, 128 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 224, 224, 128 0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
flatten (Flatten)               (None, 6422528)      0           dropout[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            6422529     flatten[0][0]                    
==================================================================================================
Total params: 6,460,929
Trainable params: 6,460,929
Non-trainable params: 0
__________________________________________________________________________________________________

RESULTS: 
ACC:0.826 
SS:0.941 
SP:0.500 
Pr:0.842 
Score:0.804 
Searching time:365.598 
Fitting time:45.534

32-128