Auto_CNN 5G-20E G2:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 224, 224, 64) 256         SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 224, 224, 64) 0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 224, 224, 512 295424      SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 224, 224, 512 2048        input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 224, 224, 512 2048        SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 224, 224, 512 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 224, 224, 512 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 112, 112, 512 0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 56, 56, 512)  0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 28, 28, 512)  0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 14, 14, 512)  0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Conv1 (Conv2D)      (None, 14, 14, 256)  1179904     average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm1 (BatchNo (None, 14, 14, 256)  1024        SkipLayer_2/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/ReLU1 (Activation)  (None, 14, 14, 256)  0           SkipLayer_2/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/Conv2 (Conv2D)      (None, 14, 14, 512)  1180160     SkipLayer_2/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Reshape (Conv2D)    (None, 14, 14, 512)  262656      average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm2 (BatchNo (None, 14, 14, 512)  2048        SkipLayer_2/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Add (Add)           (None, 14, 14, 512)  0           SkipLayer_2/Reshape[0][0]        
                                                                 SkipLayer_2/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/ReLU2 (Activation)  (None, 14, 14, 512)  0           SkipLayer_2/Add[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 100352)       0           SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            100353      flatten[0][0]                    
==================================================================================================
Total params: 3,027,713
Trainable params: 3,025,025
Non-trainable params: 2,688
__________________________________________________________________________________________________
RESULTS: 
ACC:0.783 
SS:0.824 
SP:0.667 
Pr:0.875 
Score:0.792 
Searching time:304.940 
Fitting time:0.000

Best CNN: 64-512-max-max-mean-mean-256-512 Score: 0.875
[64-512, max, max, mean, mean, 256-512]