Auto_CNN 5G-100E G1:Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 112, 112, 3)       0         
_________________________________________________________________
flatten (Flatten)            (None, 37632)             0         
_________________________________________________________________
dense (Dense)                (None, 1)                 37633     
=================================================================
Total params: 37,633
Trainable params: 37,633
Non-trainable params: 0
_________________________________________________________________
RESULTS: 
ACC:0.652 
SS:0.765 
SP:0.333 
Pr:0.765 
Score:0.650 
Searching time:1497.951 
Fitting time:0.000