Auto_CNN 10P-10E G1:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 112, 112, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 56, 56, 3)    0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 56, 56, 256)  7168        max_pooling2d[0][0]              
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 56, 56, 256)  1024        SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 56, 56, 256)  0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 56, 56, 64)   147520      SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 56, 56, 64)   256         max_pooling2d[0][0]              
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 56, 56, 64)   256         SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 56, 56, 64)   0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 56, 56, 64)   0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 28, 28, 64)   0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Conv1 (Conv2D)      (None, 28, 28, 256)  147712      average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm1 (BatchNo (None, 28, 28, 256)  1024        SkipLayer_2/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/ReLU1 (Activation)  (None, 28, 28, 256)  0           SkipLayer_2/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/Conv2 (Conv2D)      (None, 28, 28, 32)   73760       SkipLayer_2/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Reshape (Conv2D)    (None, 28, 28, 32)   2080        average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm2 (BatchNo (None, 28, 28, 32)   128         SkipLayer_2/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Add (Add)           (None, 28, 28, 32)   0           SkipLayer_2/Reshape[0][0]        
                                                                 SkipLayer_2/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/ReLU2 (Activation)  (None, 28, 28, 32)   0           SkipLayer_2/Add[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 25088)        0           SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            25089       flatten[0][0]                    
==================================================================================================
Total params: 406,017
Trainable params: 404,801
Non-trainable params: 1,216
__________________________________________________________________________________________________
RESULTS: 
ACC:0.652 
SS:0.765 
SP:0.333 
Pr:0.765 
Score:0.650 
Searching time:114.636 
Fitting time:13.614