Autokeras 200:
Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 224, 224, 3)       0         
_________________________________________________________________
normalization (Normalization (None, 224, 224, 3)       7         
_________________________________________________________________
separable_conv2d (SeparableC (None, 220, 220, 128)     587       
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 216, 216, 64)      11456     
_________________________________________________________________
dropout (Dropout)            (None, 216, 216, 64)      0         
_________________________________________________________________
flatten (Flatten)            (None, 2985984)           0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 2985984)           0         
_________________________________________________________________
dense (Dense)                (None, 1)                 2985985   
_________________________________________________________________
classification_head_1 (Activ (None, 1)                 0         
=================================================================
Total params: 2,998,035
Trainable params: 2,998,028
Non-trainable params: 7
_________________________________________________________________

RESULTS: 
ACC:0.870 
SS:0.941 
SP:0.667 
Pr:0.889 
Score:0.858 
Searching time:305.739 
Fitting time:190.370