Auto_CNN 5P-10E G10:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 224, 224, 128 3584        input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 224, 224, 128 512         SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 224, 224, 128 0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 224, 224, 256 295168      SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 224, 224, 256 1024        input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 224, 224, 256 1024        SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 224, 224, 256 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 224, 224, 256 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 12845056)     0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            12845057    flatten[0][0]                    
==================================================================================================
Total params: 13,146,369
Trainable params: 13,145,601
Non-trainable params: 768
__________________________________________________________________________________________________
RESULTS: 
ACC:0.696 
SS:0.824 
SP:0.333 
Pr:0.778 
Score:0.684 
Searching time:592.309 
Fitting time:0.000