Auto_CNN 5 G1:Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 112, 112, 3)       0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 56, 56, 3)         0         
_________________________________________________________________
flatten (Flatten)            (None, 9408)              0         
_________________________________________________________________
dense (Dense)                (None, 1)                 9409      
=================================================================
Total params: 9,409
Trainable params: 9,409
Non-trainable params: 0
_________________________________________________________________
RESULTS: 
ACC:0.565 
SS:0.706 
SP:0.167 
Pr:0.706 
Score:0.563 
Searching time:215.988 
Fitting time:0.000