Autokeras 10:Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 224, 224, 3)       0         
_________________________________________________________________
normalization (Normalization (None, 224, 224, 3)       7         
_________________________________________________________________
random_translation (RandomTr (None, 224, 224, 3)       0         
_________________________________________________________________
random_flip (RandomFlip)     (None, 224, 224, 3)       0         
_________________________________________________________________
resnet50 (Functional)        (None, 7, 7, 2048)        23587712  
_________________________________________________________________
global_average_pooling2d (Gl (None, 2048)              0         
_________________________________________________________________
dense (Dense)                (None, 1)                 2049      
_________________________________________________________________
classification_head_1 (Activ (None, 1)                 0         
=================================================================
Total params: 23,589,768
Trainable params: 23,536,641
Non-trainable params: 53,127
_________________________________________________________________
RESULTS: 
ACC:0.609 
SS:0.529 
SP:0.833 
Pr:0.900 
Score:0.684 
Searching time:956.273 
Fitting time:105.819