Auto_CNN G10:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 112, 112, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 56, 56, 3)    0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 28, 28, 3)    0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 28, 28, 128)  3584        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 28, 28, 128)  512         SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 28, 28, 128)  0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 28, 28, 128)  147584      SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 28, 28, 128)  512         max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 28, 28, 128)  512         SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 28, 28, 128)  0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 28, 28, 128)  0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 14, 14, 128)  0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
flatten (Flatten)               (None, 25088)        0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            25089       flatten[0][0]                    
==================================================================================================
Total params: 177,793
Trainable params: 177,281
Non-trainable params: 512
__________________________________________________________________________________________________
RESULTS: 
ACC:0.696 
SS:0.750 
SP:0.333 
Pr:0.882 
Score:0.680 
Searching time:669.910 
Fitting time:0.000