Auto_CNN 5P-10E G1:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 224, 224, 64) 256         SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 224, 224, 64) 0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 224, 224, 512 295424      SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 224, 224, 512 2048        input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 224, 224, 512 2048        SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 224, 224, 512 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 224, 224, 512 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
SkipLayer_2/Conv1 (Conv2D)      (None, 224, 224, 256 1179904     SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm1 (BatchNo (None, 224, 224, 256 1024        SkipLayer_2/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/ReLU1 (Activation)  (None, 224, 224, 256 0           SkipLayer_2/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/Conv2 (Conv2D)      (None, 224, 224, 128 295040      SkipLayer_2/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Reshape (Conv2D)    (None, 224, 224, 128 65664       SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/BatchNorm2 (BatchNo (None, 224, 224, 128 512         SkipLayer_2/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Add (Add)           (None, 224, 224, 128 0           SkipLayer_2/Reshape[0][0]        
                                                                 SkipLayer_2/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_2/ReLU2 (Activation)  (None, 224, 224, 128 0           SkipLayer_2/Add[0][0]            
__________________________________________________________________________________________________
SkipLayer_3/Conv1 (Conv2D)      (None, 224, 224, 32) 36896       SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/BatchNorm1 (BatchNo (None, 224, 224, 32) 128         SkipLayer_3/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/ReLU1 (Activation)  (None, 224, 224, 32) 0           SkipLayer_3/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_3/Conv2 (Conv2D)      (None, 224, 224, 512 147968      SkipLayer_3/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/Reshape (Conv2D)    (None, 224, 224, 512 66048       SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/BatchNorm2 (BatchNo (None, 224, 224, 512 2048        SkipLayer_3/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_3/Add (Add)           (None, 224, 224, 512 0           SkipLayer_3/Reshape[0][0]        
                                                                 SkipLayer_3/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_3/ReLU2 (Activation)  (None, 224, 224, 512 0           SkipLayer_3/Add[0][0]            
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 112, 112, 512 0           SkipLayer_3/ReLU2[0][0]          
__________________________________________________________________________________________________
flatten (Flatten)               (None, 6422528)      0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            6422529     flatten[0][0]                    
==================================================================================================
Total params: 8,519,329
Trainable params: 8,516,321
Non-trainable params: 3,008
__________________________________________________________________________________________________
RESULTS: 
ACC:0.739 
SS:0.941 
SP:0.167 
Pr:0.762 
Score:0.700 
Searching time:1289.660 
Fitting time:0.000