Auto_CNN 10P-10E G10:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 224, 224, 32) 896         input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 224, 224, 32) 0           SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 224, 224, 64) 256         input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 224, 224, 64) 18496       SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 224, 224, 64) 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 224, 224, 64) 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
SkipLayer_2/Conv1 (Conv2D)      (None, 224, 224, 32) 18464       SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/ReLU1 (Activation)  (None, 224, 224, 32) 0           SkipLayer_2/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Reshape (Conv2D)    (None, 224, 224, 64) 4160        SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Conv2 (Conv2D)      (None, 224, 224, 64) 18496       SkipLayer_2/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/Add (Add)           (None, 224, 224, 64) 0           SkipLayer_2/Reshape[0][0]        
                                                                 SkipLayer_2/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_2/ReLU2 (Activation)  (None, 224, 224, 64) 0           SkipLayer_2/Add[0][0]            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 224, 224, 64) 0           SkipLayer_2/ReLU2[0][0]          
__________________________________________________________________________________________________
flatten (Flatten)               (None, 3211264)      0           dropout[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            3211265     flatten[0][0]                    
==================================================================================================
Total params: 3,272,033
Trainable params: 3,272,033
Non-trainable params: 0
__________________________________________________________________________________________________
RESULTS: 
ACC:0.826 
SS:0.882 
SP:0.667 
Pr:0.882 
Score:0.825 
Searching time:165.608 
Fitting time:57.730

32-64-32-64
10P
10E
10G