Autokeras:Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 224, 224, 3)       0         
_________________________________________________________________
normalization (Normalization (None, 224, 224, 3)       7         
_________________________________________________________________
random_translation (RandomTr (None, 224, 224, 3)       0         
_________________________________________________________________
random_flip (RandomFlip)     (None, 224, 224, 3)       0         
_________________________________________________________________
random_contrast (RandomContr (None, 224, 224, 3)       0         
_________________________________________________________________
separable_conv2d (SeparableC (None, 220, 220, 32)      203       
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 216, 216, 64)      2912      
_________________________________________________________________
dropout (Dropout)            (None, 216, 216, 64)      0         
_________________________________________________________________
flatten (Flatten)            (None, 2985984)           0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 2985984)           0         
_________________________________________________________________
dense (Dense)                (None, 1)                 2985985   
_________________________________________________________________
classification_head_1 (Activ (None, 1)                 0         
=================================================================
Total params: 2,989,107
Trainable params: 2,989,100
Non-trainable params: 7
_________________________________________________________________
RESULTS: 
ACC:0.739 
SP:0.000 
SS:0.739 
Pr:1.000 
Score:0.850 
Searching time:916.284 
Fitting time:44.504