Auto_CNN 5G-20E G1:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 112, 112, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 56, 56, 3)    0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 28, 28, 3)    0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 14, 14, 3)    0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 14, 14, 256)  7168        average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 14, 14, 256)  1024        SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 14, 14, 256)  0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 14, 14, 512)  1180160     SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 14, 14, 512)  2048        average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 14, 14, 512)  2048        SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 14, 14, 512)  0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 14, 14, 512)  0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 100352)       0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            100353      flatten[0][0]                    
==================================================================================================
Total params: 1,292,801
Trainable params: 1,291,265
Non-trainable params: 1,536
__________________________________________________________________________________________________
RESULTS: 
ACC:0.696 
SS:0.882 
SP:0.167 
Pr:0.750 
Score:0.666 
Searching time:317.929 
Fitting time:0.000