Auto_CNN G2:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 224, 224, 64) 256         SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 224, 224, 64) 0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 224, 224, 512 295424      SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 224, 224, 512 2048        input_1[0][0]                    
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 224, 224, 512 2048        SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 224, 224, 512 0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 224, 224, 512 0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 112, 112, 512 0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
flatten (Flatten)               (None, 6422528)      0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            6422529     flatten[0][0]                    
==================================================================================================
Total params: 6,724,097
Trainable params: 6,722,945
Non-trainable params: 1,152
__________________________________________________________________________________________________
RESULTS: 
ACC:0.739 
SS:0.762 
SP:0.500 
Pr:0.941 
Score:0.740 
Searching time:122.404 
Fitting time:0.000