Autokeras 2:Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 224, 224, 3)       0         
_________________________________________________________________
normalization (Normalization (None, 224, 224, 3)       7         
_________________________________________________________________
conv2d (Conv2D)              (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 110, 110, 64)      0         
_________________________________________________________________
dropout (Dropout)            (None, 110, 110, 64)      0         
_________________________________________________________________
flatten (Flatten)            (None, 774400)            0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 774400)            0         
_________________________________________________________________
dense (Dense)                (None, 1)                 774401    
_________________________________________________________________
classification_head_1 (Activ (None, 1)                 0         
=================================================================
Total params: 793,800
Trainable params: 793,793
Non-trainable params: 7
_________________________________________________________________
RESULTS: 
ACC:0.783 
SS:0.800 
SP:0.667 
Pr:0.941 
Score:0.797 
Searching time:237.364 
Fitting time:0.000