Auto_CNN 5P-10E G4:Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 112, 112, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 56, 56, 3)    0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 28, 28, 3)    0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
SkipLayer_1/Conv1 (Conv2D)      (None, 28, 28, 512)  14336       average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm1 (BatchNo (None, 28, 28, 512)  2048        SkipLayer_1/Conv1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/ReLU1 (Activation)  (None, 28, 28, 512)  0           SkipLayer_1/BatchNorm1[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/Conv2 (Conv2D)      (None, 28, 28, 512)  2359808     SkipLayer_1/ReLU1[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Reshape (Conv2D)    (None, 28, 28, 512)  2048        average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
SkipLayer_1/BatchNorm2 (BatchNo (None, 28, 28, 512)  2048        SkipLayer_1/Conv2[0][0]          
__________________________________________________________________________________________________
SkipLayer_1/Add (Add)           (None, 28, 28, 512)  0           SkipLayer_1/Reshape[0][0]        
                                                                 SkipLayer_1/BatchNorm2[0][0]     
__________________________________________________________________________________________________
SkipLayer_1/ReLU2 (Activation)  (None, 28, 28, 512)  0           SkipLayer_1/Add[0][0]            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 512)  0           SkipLayer_1/ReLU2[0][0]          
__________________________________________________________________________________________________
flatten (Flatten)               (None, 100352)       0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            100353      flatten[0][0]                    
==================================================================================================
Total params: 2,480,641
Trainable params: 2,478,593
Non-trainable params: 2,048
__________________________________________________________________________________________________
RESULTS: 
ACC:0.739 
SS:0.765 
SP:0.667 
Pr:0.867 
Score:0.759 
Searching time:170.476 
Fitting time:0.000