Autokeras:Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 224, 224, 3)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 222, 222, 32)      896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 111, 111, 32)      0         
_________________________________________________________________
dropout (Dropout)            (None, 111, 111, 32)      0         
_________________________________________________________________
flatten (Flatten)            (None, 394272)            0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 394272)            0         
_________________________________________________________________
dense (Dense)                (None, 1)                 394273    
_________________________________________________________________
classification_head_1 (Activ (None, 1)                 0         
=================================================================
Total params: 395,169
Trainable params: 395,169
Non-trainable params: 0
_________________________________________________________________
RESULTS: 
ACC:0.826 
SP:0.750 
SS:0.842 
Pr:0.941 
Score:0.889 
Searching time:925.396 
Fitting time:3.785