ENAS 1:Model: "micro_network_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
sequential_2107 (Sequential) (1, 224, 224, 60)         1860      
_________________________________________________________________
enas_layer_69 (ENASLayer)    multiple                  63968     
_________________________________________________________________
reduction_layer_24 (Reductio multiple                  3520      
_________________________________________________________________
enas_layer_70 (ENASLayer)    multiple                  102688    
_________________________________________________________________
enas_layer_71 (ENASLayer)    multiple                  102688    
_________________________________________________________________
reduction_layer_25 (Reductio multiple                  7040      
_________________________________________________________________
enas_layer_72 (ENASLayer)    multiple                  250048    
_________________________________________________________________
enas_layer_73 (ENASLayer)    multiple                  250048    
_________________________________________________________________
global_average_pooling2d_12  multiple                  0         
_________________________________________________________________
dropout_16 (Dropout)         multiple                  0         
_________________________________________________________________
dense_58 (Dense)             multiple                  81        
=================================================================
Total params: 615,029
Trainable params: 602,349
Non-trainable params: 12,680
_________________________________________________________________
RESULTS: 
ACC:0.261 
SS:0.261 
SP:0.000 
Pr:1.000 
Score:0.357 
Searching time:70.165 
Fitting time:0.000