ENAS 2:Model: "micro_network_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
sequential_153 (Sequential)  (4, 224, 224, 60)         1860      
_________________________________________________________________
enas_layer_5 (ENASLayer)     multiple                  63968     
_________________________________________________________________
reduction_layer_2 (Reduction multiple                  3520      
_________________________________________________________________
enas_layer_6 (ENASLayer)     multiple                  102688    
_________________________________________________________________
enas_layer_7 (ENASLayer)     multiple                  102688    
_________________________________________________________________
reduction_layer_3 (Reduction multiple                  7040      
_________________________________________________________________
enas_layer_8 (ENASLayer)     multiple                  250048    
_________________________________________________________________
enas_layer_9 (ENASLayer)     multiple                  250048    
_________________________________________________________________
global_average_pooling2d_1 ( multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
_________________________________________________________________
dense_5 (Dense)              multiple                  81        
=================================================================
Total params: 615,029
Trainable params: 602,349
Non-trainable params: 12,680
_________________________________________________________________
RESULTS: 
ACC:0.739 
SS:0.000 
SP:0.739 
Pr:0.000 
Score:0.333 
Searching time:9463.161 
Fitting time:0.000