FPNAS2-B3 T1 BS16:Model: "functional_2835"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d_4847 (Conv2D)            (None, 224, 224, 32) 2432        input_2[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1056 (MaxPooling2 (None, 112, 112, 32) 0           conv2d_4847[120][0]              
__________________________________________________________________________________________________
conv2d_4930 (Conv2D)            (None, 112, 112, 64) 18496       max_pooling2d_1056[120][0]       
__________________________________________________________________________________________________
conv2d_4931 (Conv2D)            (None, 112, 112, 64) 18496       max_pooling2d_1056[120][0]       
__________________________________________________________________________________________________
conv2d_4932 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_4930[61][0]               
__________________________________________________________________________________________________
conv2d_4933 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_4931[61][0]               
__________________________________________________________________________________________________
batch_normalization_2692 (Batch (None, 112, 112, 64) 256         conv2d_4932[61][0]               
__________________________________________________________________________________________________
batch_normalization_2693 (Batch (None, 112, 112, 64) 256         conv2d_4933[61][0]               
__________________________________________________________________________________________________
add_1346 (Add)                  (None, 112, 112, 64) 0           batch_normalization_2692[61][0]  
                                                                 batch_normalization_2693[61][0]  
__________________________________________________________________________________________________
conv2d_4934 (Conv2D)            (None, 112, 112, 64) 36928       add_1346[61][0]                  
__________________________________________________________________________________________________
conv2d_4935 (Conv2D)            (None, 112, 112, 64) 18496       max_pooling2d_1056[120][0]       
__________________________________________________________________________________________________
conv2d_4936 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_4934[61][0]               
__________________________________________________________________________________________________
conv2d_4937 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_4935[61][0]               
__________________________________________________________________________________________________
batch_normalization_2694 (Batch (None, 112, 112, 64) 256         conv2d_4936[61][0]               
__________________________________________________________________________________________________
batch_normalization_2695 (Batch (None, 112, 112, 64) 256         conv2d_4937[61][0]               
__________________________________________________________________________________________________
add_1347 (Add)                  (None, 112, 112, 64) 0           batch_normalization_2694[61][0]  
                                                                 batch_normalization_2695[61][0]  
__________________________________________________________________________________________________
max_pooling2d_1074 (MaxPooling2 (None, 56, 56, 64)   0           add_1347[61][0]                  
__________________________________________________________________________________________________
conv2d_5178 (Conv2D)            (None, 56, 56, 64)   36928       max_pooling2d_1074[61][0]        
__________________________________________________________________________________________________
conv2d_5179 (Conv2D)            (None, 56, 56, 64)   36928       max_pooling2d_1074[61][0]        
__________________________________________________________________________________________________
conv2d_5180 (Conv2D)            (None, 56, 56, 64)   4096        conv2d_5178[2][0]                
__________________________________________________________________________________________________
conv2d_5181 (Conv2D)            (None, 56, 56, 64)   4096        conv2d_5179[2][0]                
__________________________________________________________________________________________________
batch_normalization_2826 (Batch (None, 56, 56, 64)   256         conv2d_5180[2][0]                
__________________________________________________________________________________________________
batch_normalization_2827 (Batch (None, 56, 56, 64)   256         conv2d_5181[2][0]                
__________________________________________________________________________________________________
add_1413 (Add)                  (None, 56, 56, 64)   0           batch_normalization_2826[2][0]   
                                                                 batch_normalization_2827[2][0]   
__________________________________________________________________________________________________
max_pooling2d_1129 (MaxPooling2 (None, 28, 28, 64)   0           add_1413[2][0]                   
__________________________________________________________________________________________________
flatten_1417 (Flatten)          (None, 50176)        0           max_pooling2d_1129[2][0]         
__________________________________________________________________________________________________
dropout_1417 (Dropout)          (None, 50176)        0           flatten_1417[0][0]               
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            50177       dropout_1417[0][0]               
==================================================================================================
Total params: 244,993
Trainable params: 244,225
Non-trainable params: 768
__________________________________________________________________________________________________
RESULTS: 
ACC:0.696 
SP:0.429 
SS:0.812 
Pr:0.765 
Score:0.788 
Searching time:1872.705 
Fitting time:22.662