FPNAS2-B3 T1:Model: "functional_711"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d_842 (Conv2D)             (None, 224, 224, 32) 2432        input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_843 (Conv2D)             (None, 224, 224, 32) 1024        conv2d_842[120][0]               
__________________________________________________________________________________________________
conv2d_844 (Conv2D)             (None, 224, 224, 32) 96          input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_462 (BatchN (None, 224, 224, 32) 128         conv2d_843[120][0]               
__________________________________________________________________________________________________
batch_normalization_463 (BatchN (None, 224, 224, 32) 128         conv2d_844[120][0]               
__________________________________________________________________________________________________
add_231 (Add)                   (None, 224, 224, 32) 0           batch_normalization_462[120][0]  
                                                                 batch_normalization_463[120][0]  
__________________________________________________________________________________________________
conv2d_845 (Conv2D)             (None, 224, 224, 32) 25632       add_231[120][0]                  
__________________________________________________________________________________________________
max_pooling2d_183 (MaxPooling2D (None, 112, 112, 32) 0           conv2d_845[120][0]               
__________________________________________________________________________________________________
conv2d_1011 (Conv2D)            (None, 112, 112, 64) 18496       max_pooling2d_183[120][0]        
__________________________________________________________________________________________________
max_pooling2d_220 (MaxPooling2D (None, 56, 56, 64)   0           conv2d_1011[61][0]               
__________________________________________________________________________________________________
conv2d_1218 (Conv2D)            (None, 56, 56, 128)  73856       max_pooling2d_220[61][0]         
__________________________________________________________________________________________________
conv2d_1219 (Conv2D)            (None, 56, 56, 128)  73856       max_pooling2d_220[61][0]         
__________________________________________________________________________________________________
conv2d_1220 (Conv2D)            (None, 56, 56, 128)  16384       conv2d_1218[2][0]                
__________________________________________________________________________________________________
conv2d_1221 (Conv2D)            (None, 56, 56, 128)  16384       conv2d_1219[2][0]                
__________________________________________________________________________________________________
batch_normalization_666 (BatchN (None, 56, 56, 128)  512         conv2d_1220[2][0]                
__________________________________________________________________________________________________
batch_normalization_667 (BatchN (None, 56, 56, 128)  512         conv2d_1221[2][0]                
__________________________________________________________________________________________________
add_333 (Add)                   (None, 56, 56, 128)  0           batch_normalization_666[2][0]    
                                                                 batch_normalization_667[2][0]    
__________________________________________________________________________________________________
max_pooling2d_265 (MaxPooling2D (None, 28, 28, 128)  0           add_333[2][0]                    
__________________________________________________________________________________________________
flatten_355 (Flatten)           (None, 100352)       0           max_pooling2d_265[2][0]          
__________________________________________________________________________________________________
dropout_355 (Dropout)           (None, 100352)       0           flatten_355[0][0]                
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            100353      dropout_355[0][0]                
==================================================================================================
Total params: 329,793
Trainable params: 329,153
Non-trainable params: 640
__________________________________________________________________________________________________
RESULTS: 
ACC:0.478 
SP:0.312 
SS:0.857 
Pr:0.353 
Score:0.500 
Searching time:501.339 
Fitting time:18.576