FPNAS2-B2 T4:Model: "functional_2569"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d_4490 (Conv2D)            (None, 224, 224, 8)  608         input_6[0][0]                    
__________________________________________________________________________________________________
conv2d_4491 (Conv2D)            (None, 224, 224, 8)  1608        conv2d_4490[120][0]              
__________________________________________________________________________________________________
max_pooling2d_980 (MaxPooling2D (None, 112, 112, 8)  0           conv2d_4491[120][0]              
__________________________________________________________________________________________________
conv2d_4685 (Conv2D)            (None, 112, 112, 8)  1608        max_pooling2d_980[120][0]        
__________________________________________________________________________________________________
conv2d_4686 (Conv2D)            (None, 112, 112, 8)  64          max_pooling2d_980[120][0]        
__________________________________________________________________________________________________
conv2d_4687 (Conv2D)            (None, 112, 112, 8)  64          conv2d_4685[61][0]               
__________________________________________________________________________________________________
batch_normalization_2558 (Batch (None, 112, 112, 8)  32          conv2d_4686[61][0]               
__________________________________________________________________________________________________
batch_normalization_2559 (Batch (None, 112, 112, 8)  32          conv2d_4687[61][0]               
__________________________________________________________________________________________________
add_1279 (Add)                  (None, 112, 112, 8)  0           batch_normalization_2558[61][0]  
                                                                 batch_normalization_2559[61][0]  
__________________________________________________________________________________________________
max_pooling2d_1020 (MaxPooling2 (None, 56, 56, 8)    0           add_1279[61][0]                  
__________________________________________________________________________________________________
conv2d_4718 (Conv2D)            (None, 56, 56, 16)   1168        max_pooling2d_1020[61][0]        
__________________________________________________________________________________________________
conv2d_4719 (Conv2D)            (None, 56, 56, 16)   128         max_pooling2d_1020[61][0]        
__________________________________________________________________________________________________
conv2d_4720 (Conv2D)            (None, 56, 56, 16)   256         conv2d_4718[2][0]                
__________________________________________________________________________________________________
batch_normalization_2574 (Batch (None, 56, 56, 16)   64          conv2d_4719[2][0]                
__________________________________________________________________________________________________
batch_normalization_2575 (Batch (None, 56, 56, 16)   64          conv2d_4720[2][0]                
__________________________________________________________________________________________________
add_1287 (Add)                  (None, 56, 56, 16)   0           batch_normalization_2574[2][0]   
                                                                 batch_normalization_2575[2][0]   
__________________________________________________________________________________________________
conv2d_4721 (Conv2D)            (None, 56, 56, 16)   2320        add_1287[2][0]                   
__________________________________________________________________________________________________
conv2d_4722 (Conv2D)            (None, 56, 56, 16)   256         conv2d_4721[2][0]                
__________________________________________________________________________________________________
conv2d_4723 (Conv2D)            (None, 56, 56, 16)   128         max_pooling2d_1020[61][0]        
__________________________________________________________________________________________________
batch_normalization_2576 (Batch (None, 56, 56, 16)   64          conv2d_4722[2][0]                
__________________________________________________________________________________________________
batch_normalization_2577 (Batch (None, 56, 56, 16)   64          conv2d_4723[2][0]                
__________________________________________________________________________________________________
add_1288 (Add)                  (None, 56, 56, 16)   0           batch_normalization_2576[2][0]   
                                                                 batch_normalization_2577[2][0]   
__________________________________________________________________________________________________
max_pooling2d_1030 (MaxPooling2 (None, 28, 28, 16)   0           add_1288[2][0]                   
__________________________________________________________________________________________________
flatten_1284 (Flatten)          (None, 12544)        0           max_pooling2d_1030[2][0]         
__________________________________________________________________________________________________
dropout_1284 (Dropout)          (None, 12544)        0           flatten_1284[0][0]               
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 1)            12545       dropout_1284[0][0]               
==================================================================================================
Total params: 21,073
Trainable params: 20,913
Non-trainable params: 160
__________________________________________________________________________________________________
RESULTS: 
ACC:0.565 
SP:0.357 
SS:0.889 
Pr:0.471 
Score:0.615 
Searching time:352.833 
Fitting time:6.321