FPNAS-3:Model: "functional_643"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
add_1218 (Add)                  (None, 224, 224, 3)  0           input_1[0][0]                    
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_787 (Conv2D)             (None, 112, 112, 32) 864         input_1[0][0]                    
__________________________________________________________________________________________________
inverted_residual_963 (Inverted (None, 112, 112, 32) 1064        add_1218[0][0]                   
__________________________________________________________________________________________________
batch_normalization_787 (BatchN (None, 112, 112, 32) 128         conv2d_787[0][0]                 
__________________________________________________________________________________________________
add_1219 (Add)                  (None, 112, 112, 32) 0           inverted_residual_963[0][0]      
                                                                 batch_normalization_787[0][0]    
__________________________________________________________________________________________________
inverted_residual_964 (Inverted (None, 56, 56, 64)   14720       add_1219[0][0]                   
__________________________________________________________________________________________________
split_627 (Split)               [(None, 28, 56, 64), 0           inverted_residual_964[0][0]      
__________________________________________________________________________________________________
conv2d_788 (Conv2D)             (None, 56, 56, 64)   18432       add_1219[0][0]                   
__________________________________________________________________________________________________
concatenate_627 (Concatenate)   (None, 56, 56, 64)   0           split_627[0][0]                  
                                                                 split_627[0][1]                  
__________________________________________________________________________________________________
batch_normalization_788 (BatchN (None, 56, 56, 64)   256         conv2d_788[0][0]                 
__________________________________________________________________________________________________
add_1220 (Add)                  (None, 56, 56, 64)   0           concatenate_627[0][0]            
                                                                 batch_normalization_788[0][0]    
__________________________________________________________________________________________________
conv2d_789 (Conv2D)             (None, 28, 28, 64)   36864       add_1220[0][0]                   
__________________________________________________________________________________________________
inverted_residual_965 (Inverted (None, 28, 28, 64)   55936       add_1220[0][0]                   
__________________________________________________________________________________________________
batch_normalization_789 (BatchN (None, 28, 28, 64)   256         conv2d_789[0][0]                 
__________________________________________________________________________________________________
add_1221 (Add)                  (None, 28, 28, 64)   0           inverted_residual_965[0][0]      
                                                                 batch_normalization_789[0][0]    
__________________________________________________________________________________________________
flatten_321 (Flatten)           (None, 50176)        0           add_1221[0][0]                   
__________________________________________________________________________________________________
dropout_321 (Dropout)           (None, 50176)        0           flatten_321[0][0]                
__________________________________________________________________________________________________
dense_322 (Dense)               (None, 1)            50177       dropout_321[0][0]                
==================================================================================================
Total params: 178,697
Trainable params: 175,937
Non-trainable params: 2,760
__________________________________________________________________________________________________
RESULTS: 
ACC:0.609 
SP:0.364 
SS:0.833 
Pr:0.588 
Score:0.690 
Searching time:1438.526 
Fitting time:18.048