FPNAS-6:Model: "functional_1097"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
inverted_residual_1214 (Inverte (None, 112, 112, 32) 1376        input_3[0][0]                    
__________________________________________________________________________________________________
split_900 (Split)               [(None, 56, 112, 32) 0           inverted_residual_1214[0][0]     
__________________________________________________________________________________________________
conv2d_1174 (Conv2D)            (None, 112, 112, 32) 864         input_3[0][0]                    
__________________________________________________________________________________________________
concatenate_900 (Concatenate)   (None, 112, 112, 32) 0           split_900[0][0]                  
                                                                 split_900[0][1]                  
__________________________________________________________________________________________________
batch_normalization_1174 (Batch (None, 112, 112, 32) 128         conv2d_1174[0][0]                
__________________________________________________________________________________________________
add_1264 (Add)                  (None, 112, 112, 32) 0           concatenate_900[0][0]            
                                                                 batch_normalization_1174[0][0]   
__________________________________________________________________________________________________
add_1265 (Add)                  (None, 112, 112, 32) 0           add_1264[0][0]                   
                                                                 add_1264[0][0]                   
__________________________________________________________________________________________________
conv2d_1175 (Conv2D)            (None, 56, 56, 64)   18432       add_1264[0][0]                   
__________________________________________________________________________________________________
inverted_residual_1215 (Inverte (None, 56, 56, 64)   29184       add_1265[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1175 (Batch (None, 56, 56, 64)   256         conv2d_1175[0][0]                
__________________________________________________________________________________________________
add_1266 (Add)                  (None, 56, 56, 64)   0           inverted_residual_1215[0][0]     
                                                                 batch_normalization_1175[0][0]   
__________________________________________________________________________________________________
flatten_548 (Flatten)           (None, 200704)       0           add_1266[0][0]                   
__________________________________________________________________________________________________
dropout_548 (Dropout)           (None, 200704)       0           flatten_548[0][0]                
__________________________________________________________________________________________________
dense_551 (Dense)               (None, 1)            200705      dropout_548[0][0]                
==================================================================================================
Total params: 250,945
Trainable params: 249,441
Non-trainable params: 1,504
__________________________________________________________________________________________________
RESULTS: 
ACC:0.609 
SP:0.385 
SS:0.900 
Pr:0.529 
Score:0.667 
Searching time:703.377 
Fitting time:20.410