FPNAS-2:Model: "functional_1285"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
add_4794 (Add)                  (None, 224, 224, 3)  0           input_2[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_3262 (Conv2D)            (None, 112, 112, 32) 864         input_2[0][0]                    
__________________________________________________________________________________________________
inverted_residual_3858 (Inverte (None, 112, 112, 32) 1376        add_4794[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3262 (Batch (None, 112, 112, 32) 128         conv2d_3262[0][0]                
__________________________________________________________________________________________________
add_4795 (Add)                  (None, 112, 112, 32) 0           inverted_residual_3858[0][0]     
                                                                 batch_normalization_3262[0][0]   
__________________________________________________________________________________________________
split_1903 (Split)              [(None, 56, 112, 32) 0           add_4795[0][0]                   
__________________________________________________________________________________________________
concatenate_1903 (Concatenate)  (None, 112, 112, 32) 0           split_1903[0][0]                 
                                                                 split_1903[0][1]                 
__________________________________________________________________________________________________
add_4796 (Add)                  (None, 112, 112, 32) 0           concatenate_1903[0][0]           
                                                                 add_4795[0][0]                   
__________________________________________________________________________________________________
inverted_residual_3859 (Inverte (None, 56, 56, 32)   10496       add_4796[0][0]                   
__________________________________________________________________________________________________
split_1904 (Split)              [(None, 28, 56, 32), 0           inverted_residual_3859[0][0]     
__________________________________________________________________________________________________
conv2d_3263 (Conv2D)            (None, 14, 28, 64)   18432       split_1904[0][1]                 
__________________________________________________________________________________________________
inverted_residual_3860 (Inverte (None, 14, 28, 64)   29184       split_1904[0][0]                 
__________________________________________________________________________________________________
batch_normalization_3263 (Batch (None, 14, 28, 64)   256         conv2d_3263[0][0]                
__________________________________________________________________________________________________
conv2d_3264 (Conv2D)            (None, 14, 28, 64)   18432       split_1904[0][1]                 
__________________________________________________________________________________________________
add_4797 (Add)                  (None, 14, 28, 64)   0           inverted_residual_3860[0][0]     
                                                                 batch_normalization_3263[0][0]   
__________________________________________________________________________________________________
batch_normalization_3264 (Batch (None, 14, 28, 64)   256         conv2d_3264[0][0]                
__________________________________________________________________________________________________
concatenate_1904 (Concatenate)  (None, 28, 28, 64)   0           add_4797[0][0]                   
                                                                 batch_normalization_3264[0][0]   
__________________________________________________________________________________________________
add_4798 (Add)                  (None, 28, 28, 64)   0           concatenate_1904[0][0]           
                                                                 concatenate_1904[0][0]           
__________________________________________________________________________________________________
add_4799 (Add)                  (None, 28, 28, 64)   0           add_4798[0][0]                   
                                                                 concatenate_1904[0][0]           
__________________________________________________________________________________________________
inverted_residual_3861 (Inverte (None, 28, 28, 64)   37376       add_4799[0][0]                   
__________________________________________________________________________________________________
conv2d_3265 (Conv2D)            (None, 28, 28, 128)  73728       inverted_residual_3861[0][0]     
__________________________________________________________________________________________________
inverted_residual_3862 (Inverte (None, 28, 28, 128)  54016       inverted_residual_3861[0][0]     
__________________________________________________________________________________________________
batch_normalization_3265 (Batch (None, 28, 28, 128)  512         conv2d_3265[0][0]                
__________________________________________________________________________________________________
conv2d_3266 (Conv2D)            (None, 28, 28, 128)  73728       inverted_residual_3861[0][0]     
__________________________________________________________________________________________________
add_4800 (Add)                  (None, 28, 28, 128)  0           inverted_residual_3862[0][0]     
                                                                 batch_normalization_3265[0][0]   
__________________________________________________________________________________________________
batch_normalization_3266 (Batch (None, 28, 28, 128)  512         conv2d_3266[0][0]                
__________________________________________________________________________________________________
add_4801 (Add)                  (None, 28, 28, 128)  0           add_4800[0][0]                   
                                                                 batch_normalization_3266[0][0]   
__________________________________________________________________________________________________
split_1905 (Split)              [(None, 14, 28, 128) 0           add_4801[0][0]                   
__________________________________________________________________________________________________
add_4802 (Add)                  (None, 14, 28, 128)  0           split_1905[0][0]                 
                                                                 split_1905[0][1]                 
__________________________________________________________________________________________________
conv2d_3267 (Conv2D)            (None, 7, 14, 128)   147456      split_1905[0][1]                 
__________________________________________________________________________________________________
inverted_residual_3863 (Inverte (None, 7, 14, 128)   280064      add_4802[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3267 (Batch (None, 7, 14, 128)   512         conv2d_3267[0][0]                
__________________________________________________________________________________________________
concatenate_1905 (Concatenate)  (None, 14, 14, 128)  0           inverted_residual_3863[0][0]     
                                                                 batch_normalization_3267[0][0]   
__________________________________________________________________________________________________
flatten_643 (Flatten)           (None, 25088)        0           concatenate_1905[0][0]           
__________________________________________________________________________________________________
dropout_642 (Dropout)           (None, 25088)        0           flatten_643[0][0]                
__________________________________________________________________________________________________
dense_644 (Dense)               (None, 1)            25089       dropout_642[0][0]                
==================================================================================================
Total params: 772,417
Trainable params: 762,657
Non-trainable params: 9,760
__________________________________________________________________________________________________
RESULTS: 
ACC:0.565 
SP:0.333 
SS:0.818 
Pr:0.529 
Score:0.643 
Searching time:4399.397 
Fitting time:23.366