FPNAS2-B3 T4:Model: "functional_1417"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d_2099 (Conv2D)            (None, 224, 224, 32) 896         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_457 (MaxPooling2D (None, 112, 112, 32) 0           conv2d_2099[120][0]              
__________________________________________________________________________________________________
conv2d_2278 (Conv2D)            (None, 112, 112, 64) 18496       max_pooling2d_457[120][0]        
__________________________________________________________________________________________________
conv2d_2279 (Conv2D)            (None, 112, 112, 64) 18496       max_pooling2d_457[120][0]        
__________________________________________________________________________________________________
conv2d_2280 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_2278[61][0]               
__________________________________________________________________________________________________
conv2d_2281 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_2279[61][0]               
__________________________________________________________________________________________________
batch_normalization_1246 (Batch (None, 112, 112, 64) 256         conv2d_2280[61][0]               
__________________________________________________________________________________________________
batch_normalization_1247 (Batch (None, 112, 112, 64) 256         conv2d_2281[61][0]               
__________________________________________________________________________________________________
add_623 (Add)                   (None, 112, 112, 64) 0           batch_normalization_1246[61][0]  
                                                                 batch_normalization_1247[61][0]  
__________________________________________________________________________________________________
conv2d_2282 (Conv2D)            (None, 112, 112, 64) 36928       add_623[61][0]                   
__________________________________________________________________________________________________
conv2d_2283 (Conv2D)            (None, 112, 112, 64) 18496       max_pooling2d_457[120][0]        
__________________________________________________________________________________________________
conv2d_2284 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_2282[61][0]               
__________________________________________________________________________________________________
conv2d_2285 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_2283[61][0]               
__________________________________________________________________________________________________
batch_normalization_1248 (Batch (None, 112, 112, 64) 256         conv2d_2284[61][0]               
__________________________________________________________________________________________________
batch_normalization_1249 (Batch (None, 112, 112, 64) 256         conv2d_2285[61][0]               
__________________________________________________________________________________________________
add_624 (Add)                   (None, 112, 112, 64) 0           batch_normalization_1248[61][0]  
                                                                 batch_normalization_1249[61][0]  
__________________________________________________________________________________________________
max_pooling2d_495 (MaxPooling2D (None, 56, 56, 64)   0           add_624[61][0]                   
__________________________________________________________________________________________________
conv2d_2539 (Conv2D)            (None, 56, 56, 64)   36928       max_pooling2d_495[61][0]         
__________________________________________________________________________________________________
max_pooling2d_553 (MaxPooling2D (None, 28, 28, 64)   0           conv2d_2539[2][0]                
__________________________________________________________________________________________________
flatten_708 (Flatten)           (None, 50176)        0           max_pooling2d_553[2][0]          
__________________________________________________________________________________________________
dropout_708 (Dropout)           (None, 50176)        0           flatten_708[0][0]                
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            50177       dropout_708[0][0]                
==================================================================================================
Total params: 197,825
Trainable params: 197,313
Non-trainable params: 512
__________________________________________________________________________________________________
RESULTS: 
ACC:0.696 
SP:0.400 
SS:0.778 
Pr:0.824 
Score:0.800 
Searching time:1658.100 
Fitting time:16.485