FPNAS-5:Model: "functional_667"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
split_547 (Split)               [(None, 112, 224, 3) 0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_649 (Conv2D)             (None, 56, 112, 32)  864         split_547[0][1]                  
__________________________________________________________________________________________________
inverted_residual_785 (Inverted (None, 56, 112, 32)  1376        split_547[0][0]                  
__________________________________________________________________________________________________
batch_normalization_649 (BatchN (None, 56, 112, 32)  128         conv2d_649[0][0]                 
__________________________________________________________________________________________________
conv2d_650 (Conv2D)             (None, 56, 112, 32)  864         split_547[0][1]                  
__________________________________________________________________________________________________
add_812 (Add)                   (None, 56, 112, 32)  0           inverted_residual_785[0][0]      
                                                                 batch_normalization_649[0][0]    
__________________________________________________________________________________________________
batch_normalization_650 (BatchN (None, 56, 112, 32)  128         conv2d_650[0][0]                 
__________________________________________________________________________________________________
concatenate_547 (Concatenate)   (None, 112, 112, 32) 0           add_812[0][0]                    
                                                                 batch_normalization_650[0][0]    
__________________________________________________________________________________________________
flatten_333 (Flatten)           (None, 401408)       0           concatenate_547[0][0]            
__________________________________________________________________________________________________
dropout_333 (Dropout)           (None, 401408)       0           flatten_333[0][0]                
__________________________________________________________________________________________________
dense_335 (Dense)               (None, 1)            401409      dropout_333[0][0]                
==================================================================================================
Total params: 404,769
Trainable params: 404,481
Non-trainable params: 288
__________________________________________________________________________________________________
RESULTS: 
ACC:0.565 
SP:0.300 
SS:0.769 
Pr:0.588 
Score:0.667 
Searching time:230.481 
Fitting time:6.391