FPNAS-3:Model: "functional_643"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d_1003 (Conv2D)            (None, 112, 112, 32) 864         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1003 (Batch (None, 112, 112, 32) 128         conv2d_1003[0][0]                
__________________________________________________________________________________________________
inverted_residual_963 (Inverted (None, 112, 112, 32) 752         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1004 (Conv2D)            (None, 112, 112, 32) 864         input_1[0][0]                    
__________________________________________________________________________________________________
add_1222 (Add)                  (None, 112, 112, 32) 0           batch_normalization_1003[0][0]   
                                                                 inverted_residual_963[0][0]      
__________________________________________________________________________________________________
batch_normalization_1004 (Batch (None, 112, 112, 32) 128         conv2d_1004[0][0]                
__________________________________________________________________________________________________
add_1223 (Add)                  (None, 112, 112, 32) 0           add_1222[0][0]                   
                                                                 batch_normalization_1004[0][0]   
__________________________________________________________________________________________________
conv2d_1005 (Conv2D)            (None, 56, 56, 64)   18432       add_1223[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1005 (Batch (None, 56, 56, 64)   256         conv2d_1005[0][0]                
__________________________________________________________________________________________________
inverted_residual_964 (Inverted (None, 56, 56, 64)   14720       add_1223[0][0]                   
__________________________________________________________________________________________________
add_1224 (Add)                  (None, 56, 56, 64)   0           batch_normalization_1005[0][0]   
                                                                 inverted_residual_964[0][0]      
__________________________________________________________________________________________________
split_518 (Split)               [(None, 28, 56, 64), 0           add_1224[0][0]                   
__________________________________________________________________________________________________
concatenate_518 (Concatenate)   (None, 56, 56, 64)   0           split_518[0][0]                  
                                                                 split_518[0][1]                  
__________________________________________________________________________________________________
conv2d_1006 (Conv2D)            (None, 28, 28, 64)   36864       add_1224[0][0]                   
__________________________________________________________________________________________________
inverted_residual_965 (Inverted (None, 28, 28, 64)   55936       concatenate_518[0][0]            
__________________________________________________________________________________________________
batch_normalization_1006 (Batch (None, 28, 28, 64)   256         conv2d_1006[0][0]                
__________________________________________________________________________________________________
add_1225 (Add)                  (None, 28, 28, 64)   0           inverted_residual_965[0][0]      
                                                                 batch_normalization_1006[0][0]   
__________________________________________________________________________________________________
flatten_321 (Flatten)           (None, 50176)        0           add_1225[0][0]                   
__________________________________________________________________________________________________
dropout_321 (Dropout)           (None, 50176)        0           flatten_321[0][0]                
__________________________________________________________________________________________________
dense_322 (Dense)               (None, 1)            50177       dropout_321[0][0]                
==================================================================================================
Total params: 179,377
Trainable params: 176,577
Non-trainable params: 2,800
__________________________________________________________________________________________________
RESULTS: 
ACC:0.609 
SP:0.364 
SS:0.833 
Pr:0.588 
Score:0.690 
Searching time:1427.182 
Fitting time:17.886