FPNAS2-B3 T1 Red2:Model: "functional_3553"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_8 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d_5935 (Conv2D)            (None, 224, 224, 32) 896         input_8[0][0]                    
__________________________________________________________________________________________________
conv2d_5936 (Conv2D)            (None, 224, 224, 32) 896         input_8[0][0]                    
__________________________________________________________________________________________________
conv2d_5937 (Conv2D)            (None, 224, 224, 32) 1024        conv2d_5935[179][0]              
__________________________________________________________________________________________________
conv2d_5938 (Conv2D)            (None, 224, 224, 32) 1024        conv2d_5936[179][0]              
__________________________________________________________________________________________________
batch_normalization_3240 (Batch (None, 224, 224, 32) 128         conv2d_5937[179][0]              
__________________________________________________________________________________________________
batch_normalization_3241 (Batch (None, 224, 224, 32) 128         conv2d_5938[179][0]              
__________________________________________________________________________________________________
add_1620 (Add)                  (None, 224, 224, 32) 0           batch_normalization_3240[179][0] 
                                                                 batch_normalization_3241[179][0] 
__________________________________________________________________________________________________
max_pooling2d_1296 (MaxPooling2 (None, 112, 112, 32) 0           add_1620[179][0]                 
__________________________________________________________________________________________________
conv2d_6072 (Conv2D)            (None, 112, 112, 64) 18496       max_pooling2d_1296[179][0]       
__________________________________________________________________________________________________
conv2d_6073 (Conv2D)            (None, 112, 112, 64) 2048        max_pooling2d_1296[179][0]       
__________________________________________________________________________________________________
conv2d_6074 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_6072[120][0]              
__________________________________________________________________________________________________
batch_normalization_3312 (Batch (None, 112, 112, 64) 256         conv2d_6073[120][0]              
__________________________________________________________________________________________________
batch_normalization_3313 (Batch (None, 112, 112, 64) 256         conv2d_6074[120][0]              
__________________________________________________________________________________________________
add_1656 (Add)                  (None, 112, 112, 64) 0           batch_normalization_3312[120][0] 
                                                                 batch_normalization_3313[120][0] 
__________________________________________________________________________________________________
conv2d_6075 (Conv2D)            (None, 112, 112, 64) 36928       add_1656[120][0]                 
__________________________________________________________________________________________________
conv2d_6076 (Conv2D)            (None, 112, 112, 64) 4096        conv2d_6075[120][0]              
__________________________________________________________________________________________________
conv2d_6077 (Conv2D)            (None, 112, 112, 64) 2048        max_pooling2d_1296[179][0]       
__________________________________________________________________________________________________
batch_normalization_3314 (Batch (None, 112, 112, 64) 256         conv2d_6076[120][0]              
__________________________________________________________________________________________________
batch_normalization_3315 (Batch (None, 112, 112, 64) 256         conv2d_6077[120][0]              
__________________________________________________________________________________________________
add_1657 (Add)                  (None, 112, 112, 64) 0           batch_normalization_3314[120][0] 
                                                                 batch_normalization_3315[120][0] 
__________________________________________________________________________________________________
max_pooling2d_1328 (MaxPooling2 (None, 56, 56, 64)   0           add_1657[120][0]                 
__________________________________________________________________________________________________
conv2d_6393 (Conv2D)            (None, 56, 56, 64)   36928       max_pooling2d_1328[120][0]       
__________________________________________________________________________________________________
max_pooling2d_1397 (MaxPooling2 (None, 28, 28, 64)   0           conv2d_6393[61][0]               
__________________________________________________________________________________________________
conv2d_6616 (Conv2D)            (None, 28, 28, 128)  204928      max_pooling2d_1397[61][0]        
__________________________________________________________________________________________________
conv2d_6617 (Conv2D)            (None, 28, 28, 128)  8192        max_pooling2d_1397[61][0]        
__________________________________________________________________________________________________
conv2d_6618 (Conv2D)            (None, 28, 28, 128)  16384       conv2d_6616[2][0]                
__________________________________________________________________________________________________
batch_normalization_3608 (Batch (None, 28, 28, 128)  512         conv2d_6617[2][0]                
__________________________________________________________________________________________________
batch_normalization_3609 (Batch (None, 28, 28, 128)  512         conv2d_6618[2][0]                
__________________________________________________________________________________________________
add_1804 (Add)                  (None, 28, 28, 128)  0           batch_normalization_3608[2][0]   
                                                                 batch_normalization_3609[2][0]   
__________________________________________________________________________________________________
conv2d_6619 (Conv2D)            (None, 28, 28, 128)  204928      max_pooling2d_1397[61][0]        
__________________________________________________________________________________________________
conv2d_6620 (Conv2D)            (None, 28, 28, 128)  16384       add_1804[2][0]                   
__________________________________________________________________________________________________
conv2d_6621 (Conv2D)            (None, 28, 28, 128)  16384       conv2d_6619[2][0]                
__________________________________________________________________________________________________
batch_normalization_3610 (Batch (None, 28, 28, 128)  512         conv2d_6620[2][0]                
__________________________________________________________________________________________________
batch_normalization_3611 (Batch (None, 28, 28, 128)  512         conv2d_6621[2][0]                
__________________________________________________________________________________________________
add_1805 (Add)                  (None, 28, 28, 128)  0           batch_normalization_3610[2][0]   
                                                                 batch_normalization_3611[2][0]   
__________________________________________________________________________________________________
max_pooling2d_1447 (MaxPooling2 (None, 14, 14, 128)  0           add_1805[2][0]                   
__________________________________________________________________________________________________
flatten_1778 (Flatten)          (None, 25088)        0           max_pooling2d_1447[2][0]         
__________________________________________________________________________________________________
dropout_1778 (Dropout)          (None, 25088)        0           flatten_1778[0][0]               
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 1)            25089       dropout_1778[0][0]               
==================================================================================================
Total params: 604,097
Trainable params: 602,433
Non-trainable params: 1,664
__________________________________________________________________________________________________
RESULTS: 
ACC:0.261 
SP:0.261 
SS:0.000 
Pr:0.000 
Score:0.000 
Searching time:714.440 
Fitting time:20.185