FPNAS-B2 T4:Model: "functional_301"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_18 (InputLayer)           [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d_219 (Conv2D)             (None, 112, 112, 32) 864         input_18[0][0]                   
__________________________________________________________________________________________________
inverted_residual_104 (Inverted (None, 112, 112, 32) 1376        input_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_132 (BatchN (None, 112, 112, 32) 128         conv2d_219[0][0]                 
__________________________________________________________________________________________________
add_108 (Add)                   (None, 112, 112, 32) 0           inverted_residual_104[0][0]      
                                                                 batch_normalization_132[0][0]    
__________________________________________________________________________________________________
inverted_residual_105 (Inverted (None, 56, 56, 64)   14720       add_108[0][0]                    
__________________________________________________________________________________________________
split_85 (Split)                [(None, 28, 56, 64), 0           inverted_residual_105[0][0]      
__________________________________________________________________________________________________
conv2d_220 (Conv2D)             (None, 56, 56, 64)   18432       add_108[0][0]                    
__________________________________________________________________________________________________
concatenate_85 (Concatenate)    (None, 56, 56, 64)   0           split_85[0][0]                   
                                                                 split_85[0][1]                   
__________________________________________________________________________________________________
batch_normalization_133 (BatchN (None, 56, 56, 64)   256         conv2d_220[0][0]                 
__________________________________________________________________________________________________
add_109 (Add)                   (None, 56, 56, 64)   0           concatenate_85[0][0]             
                                                                 batch_normalization_133[0][0]    
__________________________________________________________________________________________________
flatten_150 (Flatten)           (None, 200704)       0           add_109[0][0]                    
__________________________________________________________________________________________________
dropout_150 (Dropout)           (None, 200704)       0           flatten_150[0][0]                
__________________________________________________________________________________________________
dense_167 (Dense)               (None, 1)            200705      dropout_150[0][0]                
==================================================================================================
Total params: 236,481
Trainable params: 235,489
Non-trainable params: 992
__________________________________________________________________________________________________
RESULTS: 
ACC:0.913 
SP:1.000 
SS:0.895 
Pr:1.000 
Score:0.944 
Searching time:83.725 
Fitting time:16.678