OriginalNN:Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 54, 54, 64)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 186624)            0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 186625    
=================================================================
Total params: 242,945
Trainable params: 242,945
Non-trainable params: 0
_________________________________________________________________
RESULTS: 
ACC:0.435 
SP:0.182 
SS:0.667 
Pr:0.471 
Score:0.552 
Searching time:0.078 
Fitting time:12.525