OriginalNN:Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_21 (Dropout)         (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_22 (Dropout)         (None, 54, 54, 64)        0         
_________________________________________________________________
flatten_21 (Flatten)         (None, 186624)            0         
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 186625    
=================================================================
Total params: 242,945
Trainable params: 242,945
Non-trainable params: 0
_________________________________________________________________
RESULTS: 
ACC:0.652 
SP:0.333 
SS:0.765 
Pr:0.765 
Score:0.765 
Searching time:0.102 
Fitting time:12.592