OriginalNN 2:Model: "sequential_2260"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_666 (Conv2D)          (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_667 (Conv2D)          (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d_744 (MaxPoolin (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_668 (Conv2D)          (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_745 (MaxPoolin (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 54, 54, 64)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 186624)            0         
_________________________________________________________________
dense_63 (Dense)             (None, 1)                 186625    
=================================================================
Total params: 242,945
Trainable params: 242,945
Non-trainable params: 0
_________________________________________________________________
RESULTS: 
ACC:0.826 
SS:0.750 
SP:0.842 
Pr:0.500 
Score:0.737 
Searching time:0.110 
Fitting time:12.560