OriginalNN 3:Model: "sequential_460"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_141 (Conv2D)          (None, 222, 222, 32)      896       
_________________________________________________________________
conv2d_142 (Conv2D)          (None, 220, 220, 64)      18496     
_________________________________________________________________
max_pooling2d_152 (MaxPoolin (None, 110, 110, 64)      0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_143 (Conv2D)          (None, 108, 108, 64)      36928     
_________________________________________________________________
max_pooling2d_153 (MaxPoolin (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 54, 54, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 186624)            0         
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 186625    
=================================================================
Total params: 242,945
Trainable params: 242,945
Non-trainable params: 0
_________________________________________________________________
RESULTS: 
ACC:0.783 
SS:0.800 
SP:0.667 
Pr:0.941 
Score:0.797 
Searching time:0.102 
Fitting time:10.610